---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
UpdaterRegistry..::..UnregisterUpdater Method
UpdaterRegistry Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | UnregisterUpdater(UpdaterId) | Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater. |
|  | UnregisterUpdater(UpdaterId, Document) | Unregisters an updater for the given document. |

# See Also

UpdaterRegistry Class

UpdaterRegistry Members

Autodesk.Revit.DB Namespace